//Створити клас Машина з полями рік(int), швидкість(double), вага(int) колір(String).
// Створити конструктор за замовчуванням, конструктор з 1 параметром, 2-а, 3-а, 4-а.
// Перевантажити конструктори викликаючи конструктор із конструктора.
// Створити клас Main, де створити екземпляри класу Машина з різними параметрами.
public class Main {
    public static void main(String[] args) {
        Car car0 = new Car();
        Car car1 = new Car(2013);
        Car car2 = new Car(2014, 120.5);
        Car car3 = new Car(2015, 120.5, 1300);
        Car car4 = new Car(2015, 120.5, 1300, "red");
    }
}